Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་འབྲུག་སྒྲ་རྫ་མཁན་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟབས་དེ་ལ། །སྤོས་དང་རིལ་བ་གཅིག་ཅིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Meghasvara, when a potter, Offered fragrances and a water pot To the thus-gone Lion Gait And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་སེམས་ཁྱེའུ་ལོ་གསུམ་ལོན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་གཟིགས་ལ། །པད་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucintita, when three years old, Offered lotus flowers To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡིད་བཟང་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྩལ་སྦྱིན་དེ་ལ་ནི། །སྣ་མའི་མེ་ཏོག་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumanas, when the son of a merchant, Offered a garland of sumanā flowers To the thus-gone Energy Gift And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲི་མེད་ཐ་ག་པར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་མཐོང་དེ་ལ་ནི། །འབའ་ཤ་ཀ་གཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimala, when a weaver, Offered a woolen robe To the thus-gone Excellent Sight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་གླང་ཆེན་འདུལ་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟུགས་བཟང་དེ་ལ་ནི། །མེ་ཏོག་ཕྲེང་བ་ཁྲུ་གང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śaśin, when an elephant tamer, Offered a cubit of flower garlands To the thus-gone Excellent Form And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་ཆེན་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་གྲགས་དེ་ལ། །མེ་ཏོག་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāyaśas, when a city beggar, Offered flowers To the thus-gone Famed Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཙུག་ན་ནོར་བུ་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་བཀོད་དེ་ལ། །ས་རྡུལ་སྤར་གང་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇicūḍa, when a boy, Offered a handful of earth To the thus-gone Jewel Array And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དྲག་ཤུལ་ལྷའི་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤ་བའི་འོད་དེ་ལ། །ལྷ་ཡི་གཞལ་མེད་ཁང་གཅིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ugra, when a divine son, Offered a divine palace To the thus-gone Majestic Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་སྟབས་གདུགས་མཁན་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པར་བཞུད་དེ་ལ། །ཚ་བའི་དུས་ཚེ་ལོ་མའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhagati, when a parasol maker, Offered a leaf parasol during the hot season To the thus-gone Gone to Liberation And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྗོན་པ་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བཀོད་དེ་ལ། །ལམ་གྱི་ཤིང་དྲུང་དག་ཏུ་བེའུ་རས་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Druma, when a herdsman, Offered fine linen at trees by the roadside To the thus-gone Array of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་རྒྱལ་བ་ལང་རྫི་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངེས་པའི་བློ་དེ་ལ། །ལྷུང་བཟེད་འོ་མས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vijitāvin, when a cowherd, Offered an alms bowl filled with milk To the thus-gone Mind of Certainty And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་བརྩེགས་པ་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཏོག་དེ་ལ། །ཉིན་གཅིག་རངས་པར་ཆོས་ཀྱི་གདན་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñākūṭa, when a monk, Offered a Dharma seat to be used for a day To the thus-gone Crest of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་གནས་ལྷམ་མཁན་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མི་གཡོའི་བློ་དེ་ལ། །མཆིལ་ལྷམ་རིམ་པ་གཅིག་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Susthita, when a shoemaker, Offered shoes with one lining To the thus-gone Immutable Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱོད་པའི་བློ་གྲོས་ལ། །རོ་དང་ལྡན་པའི་བཏུང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mati, when a worker, Offered tasty drink To the thus-gone Intelligence in Practice And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡན་ལག་སྐྱེས་ནི་མི་འཛིན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟུགས་བཟང་དེ་ལ་ནི། །ཁྲུས་རས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aṅgaja, when a jailer, Offered bathing cloths To the thus-gone Excellent Form And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་མཐའ་ཡས་པ་ནི། །ལམ་སྟོན་གྱུར་ཚེ་བདེ་གཤེགས་བདེན་སྨྲ་ལ། །ཤིང་དྲུང་གནས་མལ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Amitabuddhi, when a guide, Offered a bed at the foot of a tree To the well-gone Truth Speaker And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་བཟང་སྡེ་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐད་དབྱངས་དེ་ལ་ནི། །མེ་ཏོག་ཨུད་པལ་ལྔ་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Surūpa, when a general, Offered five utpalas To the thus-gone Melodious Voice And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཁྱེན་ལྡན་དགོན་གནས་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་མཐོང་དེ་ཡི། །འཆག་ས་བྱི་དོར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānin, when a monk living in solitude, Offered a well-swept monastic walkway To the thus-gone Excellent Sight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་ཤིང་རྟ་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མཐའ་ཡས་ལ། །ཉལ་ཁྲི་སྟོང་རི་བ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Raśmi, when a chariot maker, Offered a bed worth one thousand To the thus-gone Infinite Splendor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་བརྟན་པ་ནི། །ཕྲེང་རྒྱུད་མཁན་ཚེ་བདེ་གཤེགས་ཡིད་འོང་སེམས། །དེ་ལ་མེ་ཏོག་བླ་རེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dṛḍhavrata, when a garland maker, Offered a canopy of flowers To the well-gone Delightful Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བཀྲ་ཤིས་ཤིང་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་ཤིང་རྟ་ལ། །བུ་ཡུག་ལངས་ཚེ་སྣང་མ་བལྟམ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Maṅgala, when a wood gatherer, Offered service during a snowstorm To the thus-gone Famed Chariot And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེན་ཏོག་ཁྲུས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མེ་ཏོག་ལ། །ཁ་གདོང་བཀྲུ་བ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satyaketu, when a bath attendant, Washed the face Of the thus-gone Flower of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་མ་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་ཟེར་ལ། །པད་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padma, when the son of a merchant, Offered lotus flowers To the thus-gone Radiant Flowers And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་བུ་ནི་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གདུལ་བར་དཀའ་ཞེས་བྱ་བ་དེའི། །ཁང་པ་བརྩེགས་པ་ཙན་དན་དམར་པོས་བྱུགས་ནས་ཀྱང་། །དང་པོ་ཁོ་ནར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Nārāyaṇa, when an incense merchant, Offered a multistoried mansion rubbed in red sandalwood To the thus-gone Hard to Subdue And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལག་བཟངས་རྒྱལ་པོའི་ཕོ་ཉའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་སྒྲོགས་པར་མཛད་པ་གང་། །འཁོར་བཅས་བྱེ་བ་དག་ལ་ཆོས་གོས་གསུམ་ཕུལ་ནས། །དང་པོ་ཁོ་ནར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Subāhu, when a royal messenger, Offered the three Dharma robes To the thus-gone Speaker with Beautiful Voice and his ten millionfold following, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱུང་གནས་ནི། །ཚན་པོ་ཆེར་གྱུར་གཡུལ་ངོར་ཆས་པའི་ཚེ། །བདེ་གཤེགས་ལེགས་མཐོང་ལ་ནི་རྒྱལ་མཚན་གཅིག །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jñānākara, when a champion about to enter the battlefield, Offered a banner To the well-gone Excellent Sight And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོའི་མཆོད་རྟེན་ལ། །སྤོས་ཀྱི་རེང་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Arciṣmat, when a physician, Offered incense sticks To the thus-gone Stūpa for Humanity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་བྱིན་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ཆེན་ཞེས་བྱ་བ། །དེ་ལ་ལམ་དག་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmadatta, when a guide, Showed the way To the thus-gone Great Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་འབྱུང་གནས་མཉན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྫི་བ་མེད་གཤེགས་དེ། །ཉན་ཐོས་འཁོར་བཅས་བྱེ་བ་བསྒྲལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnākara, when a ferryman, Ferried the thus-gone Indestructible Departure And his retinue of ten million hearers, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་མེ་ཏོག་ནོར་བུ་མཁན། །གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་བློ་གསལ་ལ། །ནོར་བུ་རིན་ཆེན་སྤྲས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusumadeva, when a jeweler, Offered a parasol studded with precious jewels To the thus-gone Clear Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ལེགས་སེམས་པ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསུང་སྙན་དེ་ལ་ནི། །ནོར་བུ་རིན་ཆེན་སྤྲས་པའི་བླ་རེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucintitārtha, when a prince, Offered a canopy studded with precious jewels To the thus-gone Melodious Voice And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་དབང་ཕྱུག་ཤིང་མཁན་གྱི། །བུར་གྱུར་ཚེ་ན་བདེ་གཤེགས་སྐར་འོད་ཀྱི། །གཤེགས་ཟམ་དག་ནི་བཤམ་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmeśvara, when the son of a carpenter, Constructed a bridge For the well-gone Starlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲགས་ཀུན་དགའ་ར་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་སྒྲོན་དེ་ལ། །མོན་སྲན་གྲེའུ་ཡི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśomati, when a garden guard, Offered māṣa flowers To the thus-gone Moon Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོབས་བརྩེགས་ཚོང་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཏོག་དེ་ལ། །སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པས་སྤྱན་དྲངས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pratibhānakūṭa, when the son of a merchant, Offered welcome and perfect generosity To the thus-gone Wisdom Crest And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེའི་རྒྱལ་མཚན་ནི། །ཚལ་གྱི་ལས་བྱེད་ཚེ་ན་དེ་བཞིན་གཤེགས། །བསོད་ནམས་བཀོད་དེ་ལ་ནི་ཨ་མྲ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vajradhvaja, when a garden worker, Offered mango fruit To the thus-gone Merit Array And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཕན་བཞེད་གྲོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་འོད་ཅེས་བྱ་བ་ལས། །ཉིན་གཅིག་སྲོག་གཅོད་སྤོང་བའི་བསླབ་གཞི་མནོས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Hitaiṣin, when the son of the leader of a city, Received the vow of refraining from killing for one day From the thus-gone Light of Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་རོལ་གྲོང་རྡལ་བྱིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱུང་གནས་ལ། །ལྷུང་བཟེད་སྦྲང་རྩིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vikrīḍitāvin, when a child in a village, Offered an alms bowl filled with honey To the thus-gone Source of Wisdom And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མུན་དང་བྲལ་བ་ཡིས། །དེ་བཞིན་གཤེགས་པ་སྲིད་མཐའ་གཟིགས་དེ་ལ། །མོན་སྲན་གྲེའུ་འབྲུ་མར་མེ་བཞག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vigatatamas Presented a lamp filled with māṣa bean oil To the thus-gone Seeing the Ends of Existence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་ལྷ་ནི་གྲོང་རྟེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགའ་བར་གཟིགས་དེ་ལ། །ཧ་སྟ་བ་ཤ་ཀ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhudeva, when a city beggar, Offered hastabashaka To the thus-gone Joyous Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རི་བོའི་རྒྱལ་མཚན་ཚོགས་ལྡན་གྱི། །ཁྱེའུར་གྱུར་ཚེ་བདེ་གཤེགས་མཐའ་ཡས་འོད། །དེ་ལ་མེ་ཏོག་ཆུན་པོ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Merudhvaja, when a young leader of a group, Offered a garland of flowers To the well-gone Infinite Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་འོད་ནི་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་འོང་དབྱངས་དེ་ལ། །མེ་ཏོག་ལས་བྱས་བླ་རེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇiprabha, when a garland maker, Offered a flower canopy To the thus-gone Compelling Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་སྙིང་པོ་ཁྲུས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་གསུང་བ་ལ། །ཁ་གདོང་བཀྲུ་བ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnagarbha, when a bath attendant, Washed the face Of the thus-gone Diverse Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་མཐོར་གཤེགས་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་སྟབས་དེ་གྲོང་ཁྱེར་དུ། །གཤེགས་པའི་ཚེ་ན་གདན་དག་བཤམས་ཏེ་བཏིང་ནས་ཀྱང་། །དང་པོ་ཁོ་ནར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Atyuccagāmin, when a city beggar, Prepared seats For the thus-gone Strength of Discipline upon his entry into the city, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐར་རྒྱལ་ད་ནུར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་ལྷ་དེ་ལ། །ཞལ་ཟས་བཅའ་བ་རྣམས་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Tiṣya, when a danur maker, Offered meals To the thus-gone God of the Land And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རུ་རིངས་གཞན་གྱི་ཁོལ་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དགའ་དེ་ལ། །ལྷུང་བཟེད་འཇམས་ཀྱིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Viṣāṇin, when a servant of others, Offered an alms bowl filled with rice gruel To the thus-gone Splendid Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་གྲགས་པ་བསོད་སྙོམས་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཐའ་ཡས་ལ། །གོས་ཀྱི་རས་མ་སོར་བཞི་ཙམ་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇakīrti, during the giving of alms, Offered cotton fabric the size of four finger widths To the thus-gone Infinite Radiance And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཉི་ཟླས་བདེ་གཤེགས་སྲིད་སྦྱིན་དེ། །འཁོར་བཅས་བྱེ་བ་སུམ་ཅུ་དག་ལ་གཙུག་ལག་ཁང་། །བཟང་པོར་ལོངས་སྤྱོད་ཕྱིར་དང་དཔག་ཚད་བཅུ་པའི་གོས། །གདིང་བ་ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candrārka Offered splendid monastic residences and ten leagues of garments and carpets To the well-gone Granter of Sovereignty and his retinue of three hundred million, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་འོད་གཞན་གྱི་ཁོལ་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཆེ་དེ་ལ། །ལྕགས་ཀྱི་སྣོད་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryaprabha, when a servant of others, Offered an iron vessel To the thus-gone Majestic Mountain And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐར་མཁན་ཚོང་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕྱོགས་གསལ་དེ་ལ་ནི། །ནོར་བུ་རིན་ཆེན་དཔག་ཚད་གཅིག་འོད་ལྡན། །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jyotiṣka, when the son of a merchant, Offered precious jewels shining their light across one league To the thus-gone Clear Direction And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སེང་ཏོག་དེད་དཔོན་གྱི། །བུར་གྱུར་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །བློ་གྲོས་བཟང་ལ་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Siṃhaketu, when a captain’s son, Offered a garland To the thus-gone Excellent Intelligence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དུས་མཁྱེན་རྒྱལ་པོ་ནི། །སྙན་དངགས་མཁན་ཚེ་བདེ་གཤེགས་ཙམ་མཆོག་ལ། །ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བསྟོད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Velāmarāja, when a poet, Offered verses of praise To the well-gone Supreme Campaka And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་སྙིང་པོ་ཡིས། །གཞན་གྱི་དགེ་འདུན་བཤོས་གསོལ་ཡི་རང་ནས། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śrīgarbha Rejoiced when others offered a meal to the saṅgha To the thus-gone Great Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྲིད་མཐའ་གཟིགས་པ་ཚལ་དག་གི། །ལས་བྱེད་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །ཁྱད་པར་སེམས་ལ་ཆབ་གཙང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhavāntadarśin, when a garden worker, Offered pure water To the thus-gone Distinguished Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གློག་འོད་རྔོན་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔའ་བོའི་སེམས་དེ་ལ། །རྩྭ་ཡི་སྟན་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vidyutprabha, when the son of a hunter, Made and offered straw seats To the thus-gone Heroic Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེས་བྱིན་པ་ཁྱིམ་བདག་གི། །བུར་གྱུར་ཚེ་ན་བདེ་གཤེགས་པད་སྙིང་ལ། །སྣ་མའི་མེ་ཏོག་ཡོད་པའི་ས་གཞི་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhadatta, when the son of a householder, Offered land with sumanā flowers To the well-gone Lotus Essence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཞན་གྱིས་མི་ཐུབ་རྒྱལ་མཚན་གྱིས། །འཇིགས་བཅས་ལམ་དུ་འདྲོན་པའི་བསེལ་བྱས་ནས། །དེ་བཞིན་གཤེགས་པ་སྲེད་མེད་བུ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aparājita­dhvaja Escorted the thus-gone Nārāyaṇa Along a dangerous route And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོག་དགའ་གྲགས་པ་བུ་རམ་ཤིང་། །འཚིར་གྱུར་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །བློ་རྣམ་འབྱེད་ལ་བུ་རམ་བཅུད་ཁུ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pramodyakīrti, when the son of a sugarcane juicer, Made sugarcane juice For the thus-gone Discerning Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྩོན་འགྲུས་བརྟན་པ་བྲམ་ཟེའི་བུར། །གྱུར་ཚེ་བདེ་གཤེགས་འོད་ཟེར་མཐའ་ཡས་ལ། །ཁྲུས་རྐྱེན་འདག་པའི་ཚལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhavīrya, when the son of a brahmin, Offered bathing soap To the well-gone Infinite Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་རྫོགས་ཆང་འཚོང་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ང་རོ་ལ། །ལོ་མའི་སྣོད་ནས་ཆུ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Saṃpannakīrti, when the son of an alcohol vendor, Offered water in leaf vessels To the thus-gone Lion’s Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསྙེངས་བྲལ་རྒྱལ་པོའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱལ་པོའི་ང་རོ་ལ། །ལོ་མའི་སྣོད་ནས་བར་ཤའི་མེ་ཏོག་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vigatabhaya, when a prince, Offered vārṣikī flowers in a leaf vessel To the thus-gone Royal Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོད་འོས་ལྷ་ནི་བློན་མཆོག་གྱུར་པའི་ཚེ། །བདེ་གཤེགས་ཡིད་འོང་བློ་འོད་དག་ལ་དཔག་ཚད་གཅིག །ཁོར་ཡུག་ཙམ་གྱི་སྐྱེད་མོས་ཚལ་ཕུལ་ཨ་ག་རུའི། །བདུག་པས་བདུགས་ཏེ་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arhaddeva, when a chief minister, Offered a one-league-large walled garden perfumed with agaru incense To the well-gone Light of Delightful Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲོན་ཆེན་མི་བཀྲེན་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་འོད་དེ་ལ། །རྩྭ་ཡི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāpradīpa, when he was destitute, Offered a grass lantern To the thus-gone Light of Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་འོད་ནི་ལྷའི་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །མེ་ཏོག་མན་དཱ་ར་བའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokaprabha, when a divine son, Offered a parasol of mandārava flowers To the thus-gone Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་དྲི་ཞིམ་པ་གྱད་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡན་ལག་མཛེས་དེ་ལ། །ཁྲུས་རས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Surabhigandha, when an athlete, Offered towels To the thus-gone Beautiful Limbs And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་མཆོག་འཛིན་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྙོག་པ་མེད་དོན་ལ། །བདུག་པ་དང་ནི་དར་ཡུག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇāgradhārin, when a physician, Offered incense and fine silk To the thus-gone Unsullied Aim And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མུན་དད་རྣམ་བྲལ་རྒྱལ་པོ་ཡི། །མདུན་འདོན་བུར་གྱུར་ཚེ་ན་དེ་བཞིན་གཤེགས། །དགྲ་བཅོམ་གཟི་ལ་མུ་ཏིག་རྒྱན་ཕྲེང་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vigatatamas, when the son of a royal priest, Offered a pearl garland To the thus-gone Splendid Worthy One And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་འགྲམ་པ་ཡིས། །དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་དེ་ལ། །འདམ་རྫབ་དག་ཏུ་ཤིང་ཟམ་བཙུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Siṃhahanu Built a wooden bridge over a swamp For the thus-gone Mind of Accomplishment And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་གྲགས་པ་སྤོས་འཚོང་གི། །བུར་གྱུར་ཚེ་ན་བདེ་གཤེགས་དབྱངས་མངའ་ལ། །ཕྱེ་མ་སྤར་གང་དག་ནི་གཏོར་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnakīrti, when the son of an incense merchant, Offered and sprinkled handfuls of incense powder To the well-gone Master of Melodies And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱོན་རབ་ཞི་བ་རྒྱལ་བུའི་ཚེ། །གསད་བྱ་བཙོན་དག་འབྲོས་སུ་བཏང་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ས་མཆོག་དེ་ལ་ནི། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśāntadoṣa, when a prince, Freed prisoners condemned to death For the thus-gone Supreme Ground And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་རྩི་འཆང་བ་གྲོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་འབར་དེ་ལ་ནི། །བཻ་དཱུརྱ་ཡི་གདུགས་སྟོང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amṛtadhārin, when the leader of a city, Offered one thousand parasols made of vaiḍūrya To the thus-gone Blazing Light And in doing so first gave rise to the mind of awakening.
